Функционал: Сохранение температуры в Москве за определенную дату

Сценарий: Получить сущность для сохранения из даты и json ответа от сервера 
	Дано json ответ сервера {"latitude":55.782074,"longitude":37.576374,"generationtime_ms":0.04398822784423828,"utc_offset_seconds":10800,"timezone":"Europe/Moscow","timezone_abbreviation":"MSK","elevation":141.0,"hourly_units":{"time":"iso8601","temperature_2m":"°C"},"hourly":{"time":["2021-10-10T00:00","2021-10-10T01:00","2021-10-10T02:00","2021-10-10T03:00","2021-10-10T04:00","2021-10-10T05:00","2021-10-10T06:00","2021-10-10T07:00","2021-10-10T08:00","2021-10-10T09:00","2021-10-10T10:00","2021-10-10T11:00","2021-10-10T12:00","2021-10-10T13:00","2021-10-10T14:00","2021-10-10T15:00","2021-10-10T16:00","2021-10-10T17:00","2021-10-10T18:00","2021-10-10T19:00","2021-10-10T20:00","2021-10-10T21:00","2021-10-10T22:00","2021-10-10T23:00"],"temperature_2m":[1.1,0.7,0.5,0.7,0.2,0.5,0.9,1.3,2.4,4.2,6.1,8.2,9.7,10.9,11.6,13.2,12.6,9.5,6.6,5.6,4.5,3.6,2.9,2.2]}}
	Дано дата 2020-10-10
	То при вызове команды MapContentToView получаю сущность 
	| Temperature | Date       |
	| 1,1         | 2020-10-10 |